Tekla Open API Reference for Tekla Structures 2025
AnalysisResult Methods
The AnalysisResult type exposes the following members.
Methods
Name | Description
Delete
 Delete analysis results by the given key.
DeleteAll
 Delete all analysis results.
DeleteLoadcase
 Delete analysis results by load case.
GetResultObjectIds
 Get ID numbers of objects with results.
GetResults
 Get analysis results.
Insert
 Insert analysis result. Results are always stored to physical parts. When OBJECT_TYPE_MEMBER or OBJECT_TYPE_AREA is used the analysis model must be active. All results for given part must be inserted within one commit (CommitChanges), older results of this part are removed automatically.
QueryAnalysisResult
 Queries an analysis result.
Top
See Also
Reference
AnalysisResult Class
Tekla.Structures.Analysis Namespace